4ms/metamodule/firmware-mp2/lib/stm32-hal/stm32mp2/Src/stm32mp2xx_hal_tmpsens.c
/**
  ******************************************************************************
  * @file    stm32mp1xx_hal_tmpsens.c
  * @author  MCD Application Team
  * @version V0.0.1
  * @date    01-July-2016
  * @brief   TMPSENS HAL module driver.  
  *          This file provides firmware functions to manage the following 
  *          functionalities of the TMPSENS peripheral:
  *           + Initialization and de-initialization functions
  *           + Start/Stop operation functions in polling mode.
  *           + Start/Stop operation functions in interrupt mode.
  *           + Peripheral Control functions
  *           + Peripheral State functions
  *         
  @verbatim
================================================================================
          ##### TMPSENS Peripheral features #####
================================================================================
           
  [..]       
      The STM32MP1xx device family integrate one TMPSENSerature sensor interface :

 
            ##### How to use this driver #####
================================================================================
  [..]

      
  @endverbatim
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2016 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32mp1xx_hal.h"

/** @addtogroup STM32MP1xx_HAL_Driver
  * @{
  */

/** @defgroup TMPSENS TMPSENS
  * @brief TMPSENS HAL module driver
  * @{
  */

#ifdef HAL_TMPSENS_MODULE_ENABLED

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/** @addtogroup TMPSENS_Private_Constants
  * @{
  */

/* @brief CFGR register reset value */
#define TMPSENS_CFGR1_RESET_VALUE (0U)

/* @brief Delay for TMPSENS startup time
 * @note  Delay required to get ready for TMPSENS Block.
 * @note  Unit: ms
 */
#define TMPSENS_DELAY_STARTUP (1U)

/* @brief TMPSENS measure ready flag time out value.
 * @note  Maximal measurement time is when LSE is selected as ref_clock and
 *        maximal sampling time is used, taking calibration into account this
 *        is equivalent to ~620 us. Use 5 ms as arbitrary timeout
 * @note Unit: ms
 */
#define TS_TIMEOUT_MS (5U)

/* @brief TMPSENS High Speed Clock frequency
 * @note Unit: 100 Hz
 */
#if defined(STM32MP1)
#define HS_CLK_FREQ   (HAL_RCC_GetPCLK3Freq())
#endif
/**
  * @}
  */

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Exported functions --------------------------------------------------------*/

/** @defgroup TMPSENS_Exported_Functions TMPSENS Exported Functions
  * @{
  */

/** @defgroup TMPSENS_Exported_Functions_Group1 Initialization/de-initialization functions
 *  @brief    Initialization and de-initialization functions.
 *
@verbatim
 ===============================================================================
              ##### Initialization and de-initialization functions #####
 ===============================================================================
    [..]  This section provides functions to initialize and de-initialize comparators

@endverbatim
  * @{
  */

/**
  * @brief  Initialize the TMPSENS according to the specified
  *         parameters in the TMPSENS_InitTypeDef and initialize the associated handle.
  * @note   If the selected comparator is locked, initialization can't be performed.
  *         To unlock the configuration, perform a system reset.
  * @param  htmpsens  TMPSENS handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_TMPSENS_Init(TMPSENS_HandleTypeDef *htmpsens)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check the TMPSENS handle allocation and lock status */
  /* Init not allowed if calibration is ongoing */
  if ((htmpsens == NULL)  || (htmpsens->State == HAL_TMPSENS_STATE_BUSY_LOCKED)
                      || (htmpsens->State == HAL_TMPSENS_STATE_CALIBBUSY))
  {
    return HAL_ERROR;
  }
  else
  {
    /* Check the parameters */
    assert_param(IS_TMPSENS_ALL_INSTANCE(htmpsens->Instance));
    assert_param(IS_TMPSENS_QUICKMEAS(htmpsens->Init.QuickMeasure));
    assert_param(IS_TMPSENS_REFCLK(htmpsens->Init.RefClock));
    assert_param(IS_TMPSENS_TRIGGERINPUT(htmpsens->Init.TriggerInput));
    assert_param(IS_TMPSENS_SAMPLINGTIME(htmpsens->Init.SamplingTime));
    assert_param(IS_TMPSENS_INTERRUPTTHRESHOLD(htmpsens->Init.HighInterruptThreshold));
    assert_param(IS_TMPSENS_INTERRUPTTHRESHOLD(htmpsens->Init.LowInterruptThreshold));

    if (htmpsens->State == HAL_TMPSENS_STATE_RESET)
    {
      /* Init the low level hardware */
      HAL_TMPSENS_MspInit(htmpsens);
    }

    /* Check Quick Measure option is enabled or disabled */
    if (htmpsens->Init.QuickMeasure == TMPSENS_QUICKMEAS_DISABLE)
    {
      /* Check Reference clock selection */
      if (htmpsens->Init.RefClock == TMPSENS_REFCLKSEL_PCLK)
      {
        assert_param(IS_TMPSENS_DIVIDER_RATIO_NUMBER(htmpsens->Init.Divider));
      }
      /* Quick measurement mode disabled */
      CLEAR_BIT(htmpsens->Instance->CFGR1, TMPSENS_CFGR1_Q_MEAS_OPT);
    }
    else
    { /* TMPSENS_QUICKMEAS_ENABLE shall be used only when the LSE clock is
         selected as reference clock */
      if (htmpsens->Init.RefClock != TMPSENS_REFCLKSEL_LSE)
      {
        return HAL_ERROR;
      }
      /* Quick measurement mode enabled
         No calibration needed */
      SET_BIT(htmpsens->Instance->CFGR1, TMPSENS_CFGR1_Q_MEAS_OPT);
    }

