4ms/metamodule/firmware-mp2/lib/stm32-hal/stm32mp2/Src/stm32mp2xx_hal_tmpsens.c
    /* set the TMPSENS clk source */
    if (htmpsens->Init.RefClock == TMPSENS_REFCLKSEL_LSE)
    {
       SET_BIT(htmpsens->Instance->CFGR1, TMPSENS_CFGR1_REFCLK_SEL);
    }
    else
    {
      CLEAR_BIT(htmpsens->Instance->CFGR1, TMPSENS_CFGR1_REFCLK_SEL);
    }

    MODIFY_REG(htmpsens->Instance->CFGR1, TMPSENS_CFGR1_HSREF_CLK_DIV,
               (htmpsens->Init.Divider << TMPSENS_CFGR1_HSREF_CLK_DIV_Pos));
    MODIFY_REG(htmpsens->Instance->CFGR1, TMPSENS_CFGR1_TS1_SMP_TIME,
               htmpsens->Init.SamplingTime);

    if (htmpsens->Init.TriggerInput == TMPSENS_TRIGGER_HW_NONE_CONT)
    {
      MODIFY_REG(htmpsens->Instance->CFGR1, TMPSENS_CFGR1_TS1_INTRIG_SEL,
                 TMPSENS_TRIGGER_HW_NONE);
    }
    else
    {
      MODIFY_REG(htmpsens->Instance->CFGR1, TMPSENS_CFGR1_TS1_INTRIG_SEL,
                 htmpsens->Init.TriggerInput);
    }

    MODIFY_REG(htmpsens->Instance->ITR1, TMPSENS_ITR1_TS1_HITTHD,
               (htmpsens->Init.HighInterruptThreshold << TMPSENS_ITR1_TS1_HITTHD_Pos));
    MODIFY_REG(htmpsens->Instance->ITR1, TMPSENS_ITR1_TS1_LITTHD,
               htmpsens->Init.LowInterruptThreshold);

    /* Set HAL TMPSENS handle state */
    if (htmpsens->State == HAL_TMPSENS_STATE_RESET)
    {
       htmpsens->State = HAL_TMPSENS_STATE_READY;
    }
  }

  return status;
}

/**
  * @brief  DeInitialize the TMPSENS peripheral.
  * @note   Deinitialization cannot be performed if the TMPSENS configuration is locked.
  *         To unlock the configuration, perform a system reset.
  * @param  htmpsens  TMPSENS handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_TMPSENS_DeInit(TMPSENS_HandleTypeDef *htmpsens)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check the TMPSENS handle allocation */
  /* DeInit not allowed if calibration is on going */
  if((htmpsens == NULL) || (htmpsens->State == HAL_TMPSENS_STATE_CALIBBUSY))
  {
    status = HAL_ERROR;
  }
  else
  {
    /* Check the parameter */
    assert_param(IS_TMPSENS_ALL_INSTANCE(htmpsens->Instance));

    /* Set TMPSENS_CFGR register to reset value */
    WRITE_REG(htmpsens->Instance->CFGR1, TMPSENS_CFGR1_RESET_VALUE);

    /* DeInit the low level hardware */
    HAL_TMPSENS_MspDeInit(htmpsens);

    htmpsens->State = HAL_TMPSENS_STATE_RESET;

    /* Release Lock */
    __HAL_UNLOCK(htmpsens);
  }

  return status;
}

/**
  * @brief  Initialize the TMPSENS MSP.
  * @param  htmpsens  TMPSENS handle
  * @retval None
  */
__weak void HAL_TMPSENS_MspInit(TMPSENS_HandleTypeDef *htmpsens)
{
  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_TMPSENS_MspInit could be implemented in the user file
   */
}

/**
  * @brief  DeInitialize the TMPSENS MSP.
  * @param  htmpsens  TMPSENS handle
  * @retval None
  */
__weak void HAL_TMPSENS_MspDeInit(TMPSENS_HandleTypeDef *htmpsens)
{
  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_TMPSENS_MspDeInit could be implemented in the user file
   */
}

/**
  * @}
  */

/** @defgroup TMPSENS_Exported_Functions_Group2 Start-Stop operation functions
 *  @brief   Start-Stop operation functions.
 *
@verbatim
 ===============================================================================
                      ##### TMPSENS Start Stop operation functions #####
 ===============================================================================
    [..]  This section provides functions allowing to:
      (+) Start a TMPSENSerature Sensor without interrupt.
      (+) Stop a TMPSENSerature Sensor  without interrupt.
      (+) Start a TMPSENSerature Sensor  with interrupt generation.
      (+) Stop a TMPSENSerature Sensor  with interrupt generation.

@endverbatim
  * @{
  */

/**
  * @brief  Start the TMPSENSerature sensor.
  * @param  htmpsens  TMPSENS handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_TMPSENS_Start(TMPSENS_HandleTypeDef *htmpsens)
{
  uint32_t tickstart = 0;
  HAL_StatusTypeDef status = HAL_OK;

  /* Check the TMPSENS handle allocation and lock status */
  if((htmpsens == NULL) || (htmpsens->State == HAL_TMPSENS_STATE_CALIBBUSY))
  {
    status = HAL_ERROR;
  }
  else
  {
    if(htmpsens->State == HAL_TMPSENS_STATE_READY)
    {
      /* Enable the selected TMPSENSerature sensor */
      __HAL_TMPSENS_ENABLE(htmpsens);

      /* Get Start Tick*/
      tickstart = HAL_GetTick();

      /* Wait till TS1_RDY flag is set */
      while (__HAL_TMPSENS_GET_FLAG(htmpsens, TMPSENS_FLAG_TS1_RDY) == RESET)
      {
        if ((int32_t) (HAL_GetTick() - tickstart ) > TMPSENS_DELAY_STARTUP)
        {
           return HAL_TIMEOUT;
        }
      }

      if(__HAL_TMPSENS_GET_TRIGGER(htmpsens,TMPSENS_TRIGGER_HW_NONE_CONT) == SET)
      {
        /* Start continuous measures */
        SET_BIT(htmpsens->Instance->CFGR1, TMPSENS_CFGR1_TS1_START);

        /* Ensure start is taken into account */
        HAL_Delay(1);
      }

      htmpsens->State = HAL_TMPSENS_STATE_BUSY;
    }
    else
    {
      status = HAL_ERROR;
    }
  }

  return status;
}
/**
  * @brief  Enable the interrupt(s) and start the TMPSENSerature sensor
  * @param  htmpsens  TMPSENS handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_TMPSENS_Start_IT(TMPSENS_HandleTypeDef *htmpsens)
{
  uint32_t tickstart = 0;
  HAL_StatusTypeDef status = HAL_OK;

  assert_param(IS_TMPSENS_INTERRUPTSOURCE(htmpsens->Init.InterruptSource));

  /* Check the TMPSENS handle allocation and lock status */
  if((htmpsens == NULL) || (htmpsens->State == HAL_TMPSENS_STATE_CALIBBUSY))
  {
    status = HAL_ERROR;
  }
  else
  {
    if(htmpsens->State == HAL_TMPSENS_STATE_READY)
    {
      /* On Asynchronous mode enable the TMPSENS EXTI line */
      if ((htmpsens->Init.InterruptSource & TMPSENS_IT_ASYNC) != RESET)
      {
        if (__HAL_TMPSENS_GET_REFCLK(htmpsens, TMPSENS_REFCLKSEL_LSE) != SET)
        {
          status = HAL_ERROR;
        }
        else
        {
          __HAL_TMPSENS_EXTI_ENABLE_IT();
        }
      }

      /* Enable the IT(s) */
      __HAL_TMPSENS_ENABLE_IT(htmpsens,htmpsens->Init.InterruptSource);

      /* Enable the selected TMPSENSerature sensor */
      __HAL_TMPSENS_ENABLE(htmpsens);

      /* Get Start Tick*/
      tickstart = HAL_GetTick();

