4ms/metamodule/firmware-mp2/lib/stm32-hal/stm32mp2/Src/stm32mp2xx_hal_tmpsens.c
      /* Wait till TS1_RDY flag is set */
      while (__HAL_TMPSENS_GET_FLAG(htmpsens, TMPSENS_FLAG_TS1_RDY) == RESET)
      {
        if ((int32_t) (HAL_GetTick() - tickstart ) > TMPSENS_DELAY_STARTUP)
        {
           return HAL_TIMEOUT;
        }
      }

      if(__HAL_TMPSENS_GET_TRIGGER(htmpsens,TMPSENS_TRIGGER_HW_NONE_CONT) == SET)
      {
        /* Start continuous measures */
        SET_BIT(htmpsens->Instance->CFGR1, TMPSENS_CFGR1_TS1_START);

        /* Ensure start is taken into account */
        HAL_Delay(1);
      }

      htmpsens->State = HAL_TMPSENS_STATE_BUSY;
    }
    else
    {
      status = HAL_ERROR;
    }
  }

  return status;
}
/**
  * @brief  Stop the TMPSENSerature Sensor.
  * @param  htmpsens  TMPSENS handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_TMPSENS_Stop(TMPSENS_HandleTypeDef *htmpsens)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check the TMPSENS handle allocation and lock status */
  if((htmpsens == NULL) || (htmpsens->State == HAL_TMPSENS_STATE_BUSY_LOCKED) \
                     || (htmpsens->State == HAL_TMPSENS_STATE_CALIBBUSY))
  {
    status = HAL_ERROR;
  }
  else
  {
    if(htmpsens->State == HAL_TMPSENS_STATE_BUSY)
    {
      if(__HAL_TMPSENS_GET_TRIGGER(htmpsens,TMPSENS_TRIGGER_HW_NONE_CONT) == SET)
      {
        CLEAR_BIT(htmpsens->Instance->CFGR1, TMPSENS_CFGR1_TS1_START);

        /* Ensure stop is taken into account */
        HAL_Delay(1);
      }

      /* Disable the selected TMPSENSerature sensor */
      __HAL_TMPSENS_DISABLE(htmpsens);

      htmpsens->State = HAL_TMPSENS_STATE_READY;
    }
    else
    {
      status = HAL_ERROR;
    }
  }

  return status;
}
/**
  * @brief  Disable the interrupt(s) and stop the TMPSENSerature sensor.
  * @param  htmpsens  TMPSENS handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_TMPSENS_Stop_IT(TMPSENS_HandleTypeDef *htmpsens)
{
  HAL_StatusTypeDef status = HAL_OK;

  assert_param(IS_TMPSENS_INTERRUPTSOURCE(htmpsens->Init.InterruptSource));

  /* Check the TMPSENS handle allocation and lock status */
  if((htmpsens == NULL) || (htmpsens->State == HAL_TMPSENS_STATE_BUSY_LOCKED) \
                     || (htmpsens->State == HAL_TMPSENS_STATE_CALIBBUSY))
  {
    status = HAL_ERROR;
  }
  else
  {
    if(htmpsens->State == HAL_TMPSENS_STATE_BUSY)
    {

      if(__HAL_TMPSENS_GET_TRIGGER(htmpsens,TMPSENS_TRIGGER_HW_NONE_CONT) == SET)
      {
        CLEAR_BIT(htmpsens->Instance->CFGR1, TMPSENS_CFGR1_TS1_START);

        /* Ensure stop is taken into account */
        HAL_Delay(1);
      }

      /* Disable the selected TMPSENSerature sensor */
      __HAL_TMPSENS_DISABLE(htmpsens);

      __HAL_TMPSENS_DISABLE_IT(htmpsens,htmpsens->Init.InterruptSource);

      /* On Asynchronous mode disable the TMPSENS EXTI line */
      if ((htmpsens->Init.InterruptSource & TMPSENS_IT_ASYNC) != RESET)
      {
        __HAL_TMPSENS_EXTI_DISABLE_IT();
      }

      htmpsens->State = HAL_TMPSENS_STATE_READY;
    }
    else
    {
      status = HAL_ERROR;
    }
  }

  return status;
}
/**
  * @brief  Get temperature from TMPSENS
  * @param  htmpsens  TMPSENS handle
  * @note   If TMPSENS_TRIGGER_HW_NONE (SW trigger) is used one measure is
  *         triggered by this function. Else (HW trigger) this function
  *         retrieves latest available measure.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_TMPSENS_GetTMPSENS(TMPSENS_HandleTypeDef *htmpsens)
{
  uint32_t tickstart = 0;

  int32_t freq_meas = 0;
  int32_t samples = 0;

  int32_t t0_temp ;
  int32_t t0_freq;
  int32_t ramp_coeff;
  uint32_t count_read = 0; /* @TODO: Erase after debug */
  uint32_t tmp_smp_time = 0;

  /* Software trigger */
  if (__HAL_TMPSENS_GET_TRIGGER(htmpsens,TMPSENS_TRIGGER_HW_NONE) == SET )
  {
    /* Start measure */
    SET_BIT(htmpsens->Instance->CFGR1, TMPSENS_CFGR1_TS1_START);

    /* Ensure start is taken into account */
    HAL_Delay(1);

    /* Stop measure */
    CLEAR_BIT(htmpsens->Instance->CFGR1, TMPSENS_CFGR1_TS1_START);

    /* Get Start Tick*/
    tickstart = HAL_GetTick();

    /* Wait till TS1_RDY flag is set */
    while (__HAL_TMPSENS_GET_FLAG(htmpsens, TMPSENS_FLAG_TS1_RDY) == RESET)
    {
      count_read++;
      if ((HAL_GetTick() - tickstart ) > TS_TIMEOUT_MS)
      {
        /* @TODO: erase after debug Ts1_Count_R and htmpsens->Measure.Ts1_Sample*/
         htmpsens->Measure.Ts1_Count_R = count_read;
         htmpsens->Measure.Ts1_Sample = (htmpsens->Instance->DR & TMPSENS_DR_TS1_MFREQ);
         return HAL_TIMEOUT;
      }
    }
  }

  /* Get the total number of samples */
  samples = (htmpsens->Instance->DR & TMPSENS_DR_TS1_MFREQ);

  /* Save the total number of samples (debug). @TODO: To erase */
  htmpsens->Measure.Ts1_Sample = samples;

  if (samples == RESET)
  {
    return HAL_ERROR;
  }

  tmp_smp_time = ((htmpsens->Instance->CFGR1 & TMPSENS_CFGR1_TS1_SMP_TIME) >> TMPSENS_CFGR1_TS1_SMP_TIME_Pos);
  if(tmp_smp_time == 0) {tmp_smp_time = 1;}

  /* Get the mean number of samples per period */
  samples /= tmp_smp_time;

  if ((htmpsens->Instance->CFGR1 & TMPSENS_CFGR1_REFCLK_SEL) == TMPSENS_REFCLKSEL_LSE)
  {
    freq_meas = LSE_VALUE * samples; /* On Hz */
  }
  else
  {
    freq_meas = HS_CLK_FREQ / samples; /* On Hz */
  }

  /* Save measured frequency (debug) */
  htmpsens->Measure.Ts1_Fmt = freq_meas;

  /* Read factory settings */
  t0_temp = htmpsens->Instance->T0VALR1 >> TMPSENS_T0VALR1_TS1_T0_Pos;
  if ((t0_temp  & TMPSENS_T0VALR1_TS1_T0) == 0U)
  {
    t0_temp = 30; /* 30 oC */
  }
  t0_freq = (htmpsens->Instance->T0VALR1 & TMPSENS_T0VALR1_TS1_FMT0) * 100; /* [Hz] */
  ramp_coeff = htmpsens->Instance->RAMPVALR & TMPSENS_RAMPVALR_TS1_RAMP_COEFF; /* [oC/Hz] */

  /* @TODO: To re-enable code below once SoC calibrated (to clean up)*/
#if 0
  if (ramp_coeff == RESET)
  {
    return HAL_ERROR;
  }
#else
  /* Figure out the temperature [oC] */
  htmpsens->Measure.Ts1_Temp = t0_temp + ((freq_meas - t0_freq) / ramp_coeff);
#endif

  return HAL_OK;
}

/**
  * @brief  TMPSENSerature sensor IRQ Handler.
  * @param  htmpsens  TMPSENS handle
  * @retval HAL status
  */
void HAL_TMPSENS_IRQHandler(TMPSENS_HandleTypeDef *htmpsens)
{
  /* TMPSENS interrupts */

  /* Check end of measure Asynchronous IT */
  if((__HAL_TMPSENS_GET_FLAG(htmpsens,TMPSENS_FLAG_TS1_AITEF)) != RESET)
  {
      __HAL_TMPSENS_CLEAR_FLAG(htmpsens,TMPSENS_CLEAR_TS1_CAITEF);
      HAL_TMPSENS_AsyncEndCallback(htmpsens);
  }

