4ms/metamodule/firmware-mp2/lib/stm32-hal/stm32mp2/Src/stm32mp2xx_hal_tmpsens.c
  /* Check low threshold Asynchronous IT */
  if((__HAL_TMPSENS_GET_FLAG(htmpsens,TMPSENS_FLAG_TS1_AITLF)) != RESET)
  {
    __HAL_TMPSENS_CLEAR_FLAG(htmpsens,TMPSENS_CLEAR_TS1_CAITLF);
    HAL_TMPSENS_AsyncLowCallback(htmpsens);
  }

  /* Check high threshold Asynchronous IT */
  if((__HAL_TMPSENS_GET_FLAG(htmpsens,TMPSENS_FLAG_TS1_AITHF)) != RESET)
  {
    __HAL_TMPSENS_CLEAR_FLAG(htmpsens,TMPSENS_CLEAR_TS1_CAITHF);
    HAL_TMPSENS_AsyncHighCallback(htmpsens);
  }

  /* Check end of measure IT */
  if((__HAL_TMPSENS_GET_FLAG(htmpsens,TMPSENS_FLAG_TS1_ITEF)) != RESET)
  {
      __HAL_TMPSENS_CLEAR_FLAG(htmpsens,TMPSENS_CLEAR_TS1_CITEF);
      HAL_TMPSENS_EndCallback(htmpsens);
  }

  /* Check low threshold IT */
  if((__HAL_TMPSENS_GET_FLAG(htmpsens,TMPSENS_FLAG_TS1_ITLF)) != RESET)
  {
      __HAL_TMPSENS_CLEAR_FLAG(htmpsens,TMPSENS_CLEAR_TS1_CITLF);
      HAL_TMPSENS_LowCallback(htmpsens);
  }

  /* Check high threshold IT */
  if((__HAL_TMPSENS_GET_FLAG(htmpsens,TMPSENS_FLAG_TS1_ITHF)) != RESET)
  {
     __HAL_TMPSENS_CLEAR_FLAG(htmpsens,TMPSENS_CLEAR_TS1_CITHF);
     HAL_TMPSENS_HighCallback(htmpsens);

  }
}

/**
  * @}
  */

/** @defgroup TMPSENS_Exported_Functions_Group3 Peripheral Control functions
 *  @brief   Management functions.
 *
@verbatim
 ===============================================================================
                      ##### Peripheral Control functions #####
 ===============================================================================
    [..]
    This subsection provides a set of functions allowing to control the TMPSENSerature sensors.

@endverbatim
  * @{
  */


/**
  * @brief  TMPSENSerature Sensor End measure callback.
  * @param  htmpsens  TMPSENS handle
  * @retval None
  */
__weak void HAL_TMPSENS_EndCallback(TMPSENS_HandleTypeDef *htmpsens)
{
  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_TMPSENS_EndCallback should be implemented in the user file
   */
}

/**
  * @brief  TMPSENSerature Sensor End measure callback.
  * @param  htmpsens  TMPSENS handle
  * @retval None
  */
__weak void HAL_TMPSENS_LowCallback(TMPSENS_HandleTypeDef *htmpsens)
{
  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_TMPSENS_EndCallback should be implemented in the user file
   */
}

/**
  * @brief  TMPSENSerature Sensor End measure callback.
  * @param  htmpsens  TMPSENS handle
  * @retval None
  */
__weak void HAL_TMPSENS_HighCallback(TMPSENS_HandleTypeDef *htmpsens)
{
  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_TMPSENS_EndCallback should be implemented in the user file
   */
}

/**
  * @brief  TMPSENSerature Sensor End measure callback.
  * @param  htmpsens  TMPSENS handle
  * @retval None
  */
__weak void HAL_TMPSENS_AsyncEndCallback(TMPSENS_HandleTypeDef *htmpsens)
{
  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_TMPSENS_EndCallback should be implemented in the user file
   */
}

/**
  * @brief  TMPSENSerature Sensor End measure callback.
  * @param  htmpsens  TMPSENS handle
  * @retval None
  */
__weak void HAL_TMPSENS_AsyncLowCallback(TMPSENS_HandleTypeDef *htmpsens)
{
  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_TMPSENS_EndCallback should be implemented in the user file
   */
}

/**
  * @brief  TMPSENSerature Sensor End measure callback.
  * @param  htmpsens  TMPSENS handle
  * @retval None
  */
__weak void HAL_TMPSENS_AsyncHighCallback(TMPSENS_HandleTypeDef *htmpsens)
{
  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_TMPSENS_EndCallback should be implemented in the user file
   */
}

/**
  * @}
  */

/** @defgroup TMPSENS_Exported_Functions_Group4 Peripheral State functions
 *  @brief   Peripheral State functions.
 *
@verbatim
 ===============================================================================
                      ##### Peripheral State functions #####
 ===============================================================================
    [..]
    This subsection permits to get in run-time the status of the peripheral.

@endverbatim
  * @{
  */

/**
  * @brief  Return the TMPSENS handle state.
  * @param  htmpsens  TMPSENS handle
  * @retval HAL state
  */
HAL_TMPSENS_StateTypeDef HAL_TMPSENS_GetState(TMPSENS_HandleTypeDef *htmpsens)
{
  /* Check the TMPSENS handle allocation */
  if(htmpsens == NULL)
  {
    return HAL_TMPSENS_STATE_RESET;
  }

  /* Return TMPSENS handle state */
  return htmpsens->State;
}
/**
  * @}
  */

/**
  * @}
  */

#endif /* HAL_COMP_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
